var ar = { "।": "|", "‘": "Ô", "’": "Õ", "“": "Ò", "”": "Ó", "্র্য": "ª¨", "ম্প্র": "¤cÖ", "র‌্য": "i¨", "ক্ষ্ম": "²", "ক্ক": "°", "ক্ট": "±", "ক্ত": "³", "ক্ব": "K¡", "স্ক্র": "¯Œ", "ক্র": "µ", "ক্ল": "K¬", "ক্ষ": "¶", "ক্স": "·", "গু": "¸", "গ্ধ": "»", "গ্ন": "Mœ", "গ্ম": "M¥", "গ্ল": "M­", "গ্রু": "Mªy", "ঙ্ক": "¼", "ঙ্ক্ষ": "•¶", "ঙ্খ": "•L", "ঙ্গ": "½", "ঙ্ঘ": "•N", "চ্ছ্ব": "”Q¡", "চ্চ": "”P", "চ্ছ": "”Q", "চ্ঞ": "”T", "জ্জ্ব": "¾¡", "জ্জ": "¾", "জ্ঝ": "À", "জ্ঞ": "Á", "জ্ব": "R¡", "ঞ্চ": "Â", "ঞ্ছ": "Ã", "ঞ্জ": "Ä", "ঞ্ঝ": "Å", "ট্ট": "Æ", "ট্ব": "U¡", "ট্ম": "U¥", "ড্ড": "Ç", "ণ্ট": "È", "ণ্ঠ": "É", "ন্স": "Ý", "ণ্ড": "Ê", "ন্তু": "š‘", "ণ্ব": "Y^", "ত্ত্ব": "Ë¡", "ত্ত": "Ë", "ত্থ": "Ì", "ত্ন": "Zœ", "ত্ম": "Z¥", "ন্ত্ব": "š—¡", "ত্ব": "Z¡", "থ্ব": "_¡", "দ্গ": "˜M", "দ্ঘ": "˜N", "দ্দ": "Ï", "দ্ধ": "×", "দ্ব": "˜¡", "দ্ব": "Ø", "দ্ভ": "™¢", "দ্ম": "Ù", "দ্রু": "`ª“", "ধ্ব": "aŸ", "ধ্ম": "a¥", "ন্ট": "›U", "ন্ঠ": "Ú", "ন্ড": "Û", "ন্ত্র": "š¿", "ন্ত": "š—", "স্ত্র": "¯¿", "ত্র": "Î", "ন্থ": "š’", "ন্দ": "›`", "ন্দ্ব": "›Ø", "ন্ধ": "Ü", "ন্ন": "bœ", "ন্ব": "š^", "ন্ম": "b¥", "প্ট": "Þ", "প্ত": "ß", "প্ন": "cœ", "প্প": "à", "প্ল": "c­", "প্স": "á", "ফ্ল": "d¬", "ব্জ": "â", "ব্দ": "ã", "ব্ধ": "ä", "ব্ব": "eŸ", "ব্ল": "e­", "ভ্র": "å", "ম্ন": "gœ", "ম্প": "¤ú", "ম্ফ": "ç", "ম্ব": "¤^", "ম্ভ": "¤¢", "ম্ভ্র": "¤£", "ম্ম": "¤§", "ম্ল": "¤­", "্র": "ª", "রু": "i“", "রূ": "iƒ", "ল্ক": "é", "ল্গ": "ê", "ল্ট": "ë", "ল্ড": "ì", "ল্প": "í", "ল্ফ": "î", "ল্ব": "j¦", "ল্ম": "j¥", "ল্ল": "j­", "শু": "ï", "শ্চ": "ð", "শ্ন": "kœ", "শ্ব": "k¦", "শ্ম": "k¥", "শ্ল": "k­", "ষ্ক": "®‹", "ষ্ক্র": "®Œ", "ষ্ট": "ó", "ষ্ঠ": "ô", "ষ্ণ": "ò", "ষ্প": "®ú", "ষ্ফ": "õ", "ষ্ম": "®§", "স্ক": "¯‹", "স্ট": "÷", "স্খ": "ö", "স্ত": "¯—", "স্তু": "¯‘", "স্থ": "¯’", "স্ন": "mœ", "স্প": "¯ú", "স্ফ": "ù", "স্ব": "¯^", "স্ম": "¯§", "স্ল": "¯­", "হু": "û", "হ্ণ": "nè", "হ্ব": "nŸ", "হ্ন": "ý", "হ্ম": "þ", "হ্ল": "n¬", "হৃ": "ü", "র্": "©", "্র": "«", "্য": "¨", "্": "&", "আ": "Av", "অ": "A", "ই": "B", "ঈ": "C", "উ": "D", "ঊ": "E", "ঋ": "F", "এ": "G", "ঐ": "H", "ও": "I", "ঔ": "J", "ক": "K", "খ": "L", "গ": "M", "ঘ": "N", "ঙ": "O", "চ": "P", "ছ": "Q", "জ": "R", "ঝ": "S", "ঞ": "T", "ট": "U", "ঠ": "V", "ড": "W", "ঢ": "X", "ণ": "Y", "ত": "Z", "থ": "_", "দ": "`", "ধ": "a", "ন": "b", "প": "c", "ফ": "d", "ব": "e", "ভ": "f", "ম": "g", "য": "h", "র": "i", "ল": "j", "শ": "k", "ষ": "l", "স": "m", "হ": "n", "ড়": "o", "ঢ়": "p", "য়": "q", "ৎ": "r", "০": "0", "১": "1", "২": "2", "৩": "3", "৪": "4", "৫": "5", "৬": "6", "৭": "7", "৮": "8", "৯": "9", "া": "v", "ি": "w", "ী": "x", "ু": "y", "ূ": "~", "ৃ": "…", "ে": "‡", "ৈ": "‰", "ৗ": "Š", "ং": "s", "ঃ": "t", "ঁ": "u" }; var aM = { "।": "|", "‘": "Ô", "’": "Õ", "“": "Ò", "”": "Ó", "্র্য": "ª¨", "ম্প্র": "¤cÖ", "র‌্য": "i¨", "ক্ষ্ম": "²", "ক্ক": "°", "ক্ট": "±", "ক্ত": "³", "ক্ব": "K¡", "স্ক্র": "¯Œ", "ক্র": "µ", "ক্ল": "K¬", "ক্ষ": "¶", "ক্স": "·", "গু": "¸", "গ্ধ": "»", "গ্ন": "Mœ", "গ্ম": "M¥", "গ্ল": "M­", "গ্রু": "Mªy", "ঙ্ক": "¼", "ঙ্ক্ষ": "•¶", "ঙ্খ": "•L", "ঙ্গ": "½", "ঙ্ঘ": "•N", "চ্ছ্ব": "”Q¡", "চ্চ": "”P", "চ্ছ": "”Q", "চ্ঞ": "”T", "জ্জ্ব": "¾¡", "জ্জ": "¾", "জ্ঝ": "À", "জ্ঞ": "Á", "জ্ব": "R¡", "ঞ্চ": "Â", "ঞ্ছ": "Ã", "ঞ্জ": "Ä", "ঞ্ঝ": "Å", "ট্ট": "Æ", "ট্ব": "U¡", "ট্ম": "U¥", "ড্ড": "Ç", "ণ্ট": "È", "ণ্ঠ": "É", "ন্স": "Ý", "ণ্ড": "Ê", "ন্তু": "š‘", "ণ্ব": "Y^", "ত্ত্ব": "Ë¡", "ত্ত": "Ë", "ত্থ": "Ì", "ত্ম": "Z¥", "ত্ন": "Zœ", "ন্ত্ব": "š—¡", "ত্ব": "Z¡", "থ্ব": "_¡", "দ্গ": "˜M", "দ্ঘ": "˜N", "দ্দ": "Ï", "দ্ধ": "×", "দ্ব": "˜¡", "দ্ব": "Ø", "দ্ভ": "™¢", "দ্ম": "Ù", "দ্রু": "`ª“", "ধ্ব": "aŸ", "ধ্ম": "a¥", "ন্ট": "›U", "ন্ড": "Û", "ন্ত্র": "š¿", "ন্ত": "š—", "স্ত্র": "¯¿", "ত্র": "Î", "ন্থ": "š’", "ন্দ": "›`", "ন্দ্ব": "›Ø", "ন্ধ": "Ü", "ন্ন": "bœ", "ন্ব": "š^", "ন্ম": "b¥", "প্ট": "Þ", "প্ত": "ß", "প্ন": "cœ", "প্প": "à", "প্ল": "c­", "প্স": "á", "ফ্ল": "d¬", "ব্জ": "â", "ব্দ": "ã", "ব্ধ": "ä", "ব্ব": "eŸ", "ব্ল": "e­", "ভ্র": "å", "ম্ন": "gœ", "ম্প": "¤ú", "ম্ফ": "ç", "ম্ব": "¤^", "ম্ভ": "¤¢", "ম্ভ্র": "¤£", "ম্ম": "¤§", "ম্ল": "¤­", "্র": "ª", "রু": "i“", "রূ": "iƒ", "ল্ক": "é", "ল্গ": "ê", "ল্ট": "ë", "ল্ড": "ì", "ল্প": "í", "ল্ফ": "î", "ল্ব": "j¦", "ল্ম": "j¥", "ল্ল": "j­", "শু": "ï", "শ্চ": "ð", "শ্ন": "kœ", "শ্ব": "k¦", "শ্ম": "k¥", "শ্ল": "k­", "ষ্ক": "®‹", "ষ্ক্র": "®Œ", "ষ্ট": "ó", "ষ্ঠ": "ô", "ষ্ণ": "ò", "ষ্প": "®ú", "ষ্ফ": "õ", "ষ্ম": "®§", "স্ক": "¯‹", "স্ট": "÷", "স্খ": "ö", "স্ত": "¯—", "স্তু": "¯‘", "স্থ": "¯’", "স্ন": "mœ", "স্প": "¯ú", "স্ফ": "ù", "স্ব": "¯^", "স্ম": "¯§", "স্ল": "¯­", "হ্ণ": "nè", "হ্ব": "nŸ", "হ্ন": "ý", "হ্ম": "þ", "হু": "û", "হ্ল": "n¬", "হৃ": "ü", "র্": "©", "্র": "Ö", "্য": "¨", "্": "&", "আ": "Av", "অ": "A", "ই": "B", "ঈ": "C", "উ": "D", "ঊ": "E", "ঋ": "F", "এ": "G", "ঐ": "H", "ও": "I", "ঔ": "J", "ক": "K", "খ": "L", "গ": "M", "ঘ": "N", "ঙ": "O", "চ": "P", "ছ": "Q", "জ": "R", "ঝ": "S", "ঞ": "T", "ট": "U", "ঠ": "V", "ড": "W", "ঢ": "X", "ণ": "Y", "ত": "Z", "থ": "_", "দ": "`", "ধ": "a", "ন": "b", "প": "c", "ফ": "d", "ব": "e", "ভ": "f", "ম": "g", "য": "h", "র": "i", "ল": "j", "শ": "k", "ষ": "l", "স": "m", "হ": "n", "ড়": "o", "ঢ়": "p", "য়": "q", "ৎ": "r", "০": "0", "১": "1", "২": "2", "৩": "3", "৪": "4", "৫": "5", "৬": "6", "৭": "7", "৮": "8", "৯": "9", "া": "v", "ি": "w", "ী": "x", "ু": "y", "ূ": "~", "ৃ": "„", "ে": "‡", "ৈ": "‰", "ৗ": "Š", "ং": "s", "ঃ": "t", "ঁ": "u" }; var aR = { "্র্য": "Ûø", "র‌্য": "kø", "ক্ষ্ম": "qô", "ক্ক": "~", "ক্ট": "ƒ", "ক্ত": "£ß", "ক্ব": "Kò", "স্ক্র": "Ç", "ক্র": "¢ß", "ক্ষ্ম": "qô", "ক্ষ": "q", "ক্স": "…", "ক্ল": "Kõ", "গু": "†", "গ্গ": "‡", "গ্ধ": "ˆ", "গ্ন": "Mí", "গ্ম": "Mô", "গ্ল": "Mö", "ঙ্ক": "‰", "ঙ্ক্ষ": "áq", "ঙ্খ": "áL", "ঙ্গ": "Š", "ঙ্ঘ": "áN", "চ্ছ্ব": "âQò", "চ্চ": "âP", "চ্ছ": "âQ", "জ্জ্ব": "Œò", "জ্জ": "Œ", "জ্ঞ": "š", "জ্ব": "Rò", "ঞ্চ": "é", "˜": "ঞ্ছ", "ঞ্জ": "™", "ঞ্ঝ": "ã", "ট্ট": "›", "ট্ব": "Uò", "ট্ম": "Uô", "ড্ড": "œ", "ণ্ঠ": "Ÿ", "ন্ঠ": "ª", "ন্স": "Ý", "ণ্ড": "¡", "ন্ত্ব": "ìòæ", "ন্তু": "š‘", "ন্তু": "ìç", "ণ্ব": "Yð", "ত্ত্ব": "£ò", "ত্থ": "¤", "ত্ন": "Zí", "ত্ম": "£ô", "ত্ম": "Zô", "ত্ত": "£", "ত্ব": "Zò", "থ্ব": "aò", "দ্দ": "¥", "দ্ধ": "¦", "দ্ব": "§", "দ্ভ": "¨", "দ্ম": "bô", "ধ্ব": "cµ", "ন্ট": "ëU", "ন্ট": "åU", "ন্ড": "«", "ন্ত্র": "ìè", "ন্ত": "ìæ", "স্ত্র": "þè", "ত্র": "¢", "ন্দ": "ëb", "ন্দ্ব": "ë§", "ন্ধ": "¬", "ন্ধ": "ëc", "ন্ন": "Ò", "ন্ন": "dí", "ন্ব": "ìñ", "ন্থ": "ìÿ", "ন্ম": "dô", "ন্স": "ëo", "প্ট": "ïU", "প্ত": "®", "প্ন": "eí", "প্প": "¯", "প্ল": "eö", "ফ্ল": "d¬", "ব্জ": "±", "ব্দ": "²", "ব্ধ": "³", "ব্ব": "gµ", "ব্ল": "gö", "ম্ভ্র": "»", "ভ্র": "¸", "ম্ন": "ií", "ম্প": "óe", "ম্ফ": "óf", "ম্ব": "¹", "ম্ভ": "º", "ম্ম": "ói", "ম্ল": "óö", "ল্ক": "¿", "ল্গ": "ùM", "ল্ট": "ùU", "ল্ড": "À", "ল্প": "ùe", "ল্ফ": "ùf", "ল্ব": "lð", "ল্ম": "lô", "ল্ল": "Á", "শু": "Â", "শ্চ": "úP", "শ্ন": "mí", "শ্ব": "mð", "শ্ম": "mô", "শ্ল": "mö", "ষ্ক": "ûK", "ষ্ক্র": "û¢ß", "ষ্ট": "Ä", "ষ্ঠ": "Å", "ষ্প": "ûe", "ষ্ফ": "üf", "ষ্ম": "ûô", "স্ক": "Æ", "স্খ": "ýL", "স্ট": "ýU", "স্থ": "þÿ", "স্ত": "þæ", "স্তু": "þç", "স্ন": "þí", "স্প": "þe", "স্ফ": "ýf", "স্ব": "È", "স্ব": "þñ", "স্ম": "þô", "হু": "É", "হ্ণ": "pî", "হ্ন": "pß", "হ্ব": "pµ", "হ্ম": "Ê", "হ্ল": "n¬", "হ্ল": "põ", "হৃ": "pÕ", "ব": "ò", "র্": "ê", "্র": "Þ", "্য": "ø", "্": "z", "আ": "Aw", "অ": "A", "ই": "B", "ঈ": "C", "উ": "D", "ঊ": "E", "ঋ": "F", "এ": "G", "ঐ": "H", "ও": "I", "ঔ": "J", "ক": "K", "খ": "L", "গ": "M", "ঘ": "N", "ঙ": "O", "চ": "P", "ছ": "Q", "জ": "R", "ঝ": "S", "ঞ": "T", "ট": "U", "ঠ": "V", "ড": "W", "ঢ": "X", "ণ": "Y", "ত": "Z", "থ": "¤", "দ": "b", "ধ": "c", "ন": "d", "প": "e", "ফ": "f", "ব": "g", "ভ": "h", "ম": "i", "য": "j", "র": "k", "ল": "l", "শ": "m", "ষ": "n", "স": "o", "হ": "p", "ড়": "r", "ঢ়": "s", "য়": "t", "থ": "a", "ৎ": "u", "ং": "v", "ঁ": "^", "ঃ": "\:", "০": "0", "১": "1", "২": "2", "৩": "3", "৪": "4", "৫": "5", "৬": "6", "৭": "7", "৮": "8", "৯": "9", "া": "w", "ি": "x", "ী": "y", "ু": "×", "ূ": "Ô", "ৃ": "Ú", "ে": "Ë", "ৈ": "Ð", "ৗ": "#", "।": "„" }; var aS = { "ন্ত্র": "ੰ੬", "ক্র": "ਠઙ", "ষ্ট্র": "ੈચ", "স্ক্র": "੍", "ক্ত": "ਡઙ", "র\u200C্য": "রઘ", "স্ক": "ੌ", "ঙ্গ": "ਔ", "ঙ্ক": "ਓ", "ষ্ঠ": "ੋ", "ষ্ট": "ੈ", "ত্র": "੬", "ত্র": "ਠ", "ক্ষ": "ਉ", "ঞ্জ": "ਙ", "দ্দ": "ਣ", "প্ত": "ਮ", "ত্ত": "ਡ", "দ্ব": "ਦ", "দ্ধ": "ਤ", "ন্ড": "ਫ", "ম্ব": "ਹ", "ম্ন": "ઃੱ", "ম্ভ": "਼", "জ্ঞ": "ਛ", "জ্জ": "ਕ", "ন্ধ": "ਬ", "ন্ব": "নੴ", "ট্ট": "ਜ", "ন্ঠ": "ਞ", "ন্ত": "ੰ੪", "ল্ড": "ੀ", "ল্ক": "ਿ", "ক্স": "ਈ", "ণ্ড": "ਟ", "ন্ড": "ਫ", "ক্ট": "ਇ", "দ্র": "ਨ", "ব্দ": "ਲ਼", "ল্ল": "ੁ", "স্ব": "ਖ਼", "ন্ন": "ਭ", "ঞ্চ": "ਗ", "ষ্ক": "ઊ", "ড়্গ": "ੜ", "ড্ড": "ਝ", "ভ্র": "ਸ", "স্ত": "એ੪", "স্থ": "એઐ", "ফ্র": "ਰ", "গ্ধ": "ਐ", "প্প": "ਯ", "দ্ভ": "ਧ", "ব্ধ": "ਵ", "ঞ্ছ": "ਘ", "ষ্ণ": "ষ੨", "হ্র": "হછ", "ূ": "ખ", "্য": "ઘ", "ন্": "੯", "ণ্": "੩", "ঙ্": "੦", "র্": "ગ", "শ্": "ઉ", "স্": "એ", "্ন": "ੱ", "ম্": "ઃ", "্ম": "અ", "চ্": "੧", "্ব": "ં", "্ল": "આ", "ল্": "ઈ", "্থ": "ઐ", "্র": "ઝ", "ৎ": "ਅ", "৯": "ঌ", "ু": "ઓ", "ৈ": "ৌ", "ৃ": "ৄ", "গু": "ਊ", "তু": "੫", "ত্থ": "ਢ", "হু": "ਗ਼", "।": "৷", "\"": "�", "\,": "৴", "\'": "৸", "\!": "৲", "\;": "৵" };
function ci(w) {
    var cY = 0;
    for (var i = 0; i < w.length; i++) {
        if (i < w.length && ao(w.charAt(i))) {
            var j = 1;
            while (v(w.charAt(i - j))) {
                if (i - j < 0) break;
                if (i - j <= cY) break;
                if (D(w.charAt(i - j - 1))) j += 2;
                else break;
            }
            var R = w.substring(0, i - j);
            R += w.charAt(i);
            R += w.substring(i - j, i);
            R += w.substring(i + 1, w.length);
            w = R;
            cY = i + 1;
            continue;
        }
        if (i < w.length - 1 && D(w.charAt(i)) && w.charAt(i - 1) == 'র' && !D(w.charAt(i - 2))) {
            var j = 1;
            var aZ = 0;
            while (true) {
                if (v(w.charAt(i + j)) && D(w.charAt(i + j + 1))) j += 2;
                else if (v(w.charAt(i + j)) && ao(w.charAt(i + j + 1))) {
                    aZ = 1;
                    break;
                } else break;
            }
            var R = w.substring(0, i - 1);
            R += w.substring(i + j + 1, i + j + aZ + 1);
            R += w.substring(i + 1, i + j + 1);
            R += w.charAt(i - 1);
            R += w.charAt(i);
            R += w.substring(i + j + aZ + 1, w.length);
            w = R;
            i += (j + aZ);
            cY = i + 1;
            continue;
        }
    }
    return w;
};
var fb = "0123456789ABCDEF";

function fa(d) {
    var h = fb.substr(d & 15, 1);
    while (d > 15) {
        d >>= 4;
        h = fb.substr(d & 15, 1) + h;
    }
    while (h.length < 4) h = "0" + h;
    return h;
};

function bF(line, ef) {
    var text = "";
    for (i = 0; i < line.length; i++) {
        if (eu(line.charCodeAt(i))) text += line.charAt(i);
        else text += "&#" + (ef ? fa(line.charCodeAt(i), 16) : line.charCodeAt(i)) + ";";
    }
    return text;
};
function cX(az, line)
{
    var G = ar;
    if (az == "bijoy") G = ar;
    else if (az == "somewherein") G = aM;
    else if (az == "boisakhi") G = aR;
    else if (az == "bangsee") G = aS;
    else if (az == "bornosoft") {
        alert("Not done yet");
        return line;
    } else if (az == "phonetic")
    {
        alert("Not done yet");
        return line;
    }
    else if (az == "htmlsafehex")
        return bF(line, true);
    else if (az == "htmlsafedec")
        return bF(line, false);
    var an; an = new RegExp("ো", "g");
    line = line.replace(an, "ো");
    an = new RegExp("ৌ", "g");
    line = line.replace(an, "ৌ");
    line = ci(line);
    for (var eI in G) {
        an = new RegExp(eI, "g"); line = line.replace(an, G[eI]);
    }
    return line;
}

function bA(e) {
    if (e == "০" || e == "১" || e == "২" || e == "৩" || e == "৪" || e == "৫" || e == "৬" || e == "৭" || e == "৮" || e == "৯") return true;
    return false
}

function ao(e) {
    if (e == "ি" || e == "ৈ" || e == "ে") return true;
    return false
}

function aJ(e) {
    if (e == "া" || e == "ো" || e == "ৌ" || e == "ৗ" || e == "ু" || e == "ূ" || e == "ী" || e == "ৃ") return true;
    return false
}

function ah(e) {
    if (ao(e) || aJ(e)) return true;
    return false
}

function v(e) {
    if (e == "ক" || e == "খ" || e == "গ" || e == "ঘ" || e == "ঙ" || e == "চ" || e == "ছ" || e == "জ" || e == "ঝ" || e == "ঞ" || e == "ট" || e == "ঠ" || e == "ড" || e == "ঢ" || e == "ণ" || e == "ত" || e == "থ" || e == "দ" || e == "ধ" || e == "ন" || e == "প" || e == "ফ" || e == "ব" || e == "ভ" || e == "ম" || e == "শ" || e == "ষ" || e == "স" || e == "হ" || e == "য" || e == "র" || e == "ল" || e == "য়" || e == "ং" || e == "ঃ" || e == "ঁ" || e == "ৎ") return true;
    return false
}

function Q(e) {
    if (e == "অ" || e == "আ" || e == "ই" || e == "ঈ" || e == "উ" || e == "ঊ" || e == "ঋ" || e == "ঌ" || e == "এ" || e == "ঐ" || e == "ও" || e == "ঔ") return true;
    return false
}

function aF(e) {
    if (e == "ং" || e == "ঃ" || e == "ঁ") return true;
    return false
}

function bS(e) {
    if (e == "্য" || e == "্র") return true;
    return false
}

function D(e) {
    if (e == "্") return true;
    return false
}

function eT(e) {
    if (bA(e) || ah(e) || v(e) || Q(e) || aF(e) || bS(e) || D(e)) return true;
    return false
}

function eu(e) {
    if (e >= 0 && e < 128) return true;
    return false
}

function cy(e) {
    if (e == " " || e == "	" || e == "\n" || e == "\r") return true;
    return false
}

function cJ(e) {
    var t = "";
    if (e == "া") t = "আ";
    else if (e == "ি") t = "ই";
    else if (e == "ী") t = "ঈ";
    else if (e == "ু") t = "উ";
    else if (e == "ূ") t = "ঊ";
    else if (e == "ৃ") t = "ঋ";
    else if (e == "ে") t = "এ";
    else if (e == "ৈ") t = "ঐ";
    else if (e == "ো") t = "ও";
    else if (e == "ো") t = "ও";
    else if (e == "ৌ") t = "ঔ";
    else if (e == "ৌ") t = "ঔ";
    return t
}

function bc(e) {
    var t = "";
    if (e == "আ") t = "া";
    else if (e == "ই") t = "ি";
    else if (e == "ঈ") t = "ী";
    else if (e == "উ") t = "ু";
    else if (e == "ঊ") t = "ূ";
    else if (e == "ঋ") t = "ৃ";
    else if (e == "এ") t = "ে";
    else if (e == "ঐ") t = "ৈ";
    else if (e == "ও") t = "ো";
    else if (e == "ঔ") t = "ৌ";
    return t
}

